package com.example.tsumapapp.ui.screens

import androidx.compose.runtime.Composable
import androidx.compose.ui.Modifier
import kotlin.math.exp


//наши оубчающее данные — цифры от 0-9 в сетке 5x5 - слева направо сверху вниз
val trainingData = listOf(//список пар цифр
    //Зиро
    Pair(
        doubleArrayOf(// 25 чисел, это пиксели цифры
            0.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,1.0,
            1.0,0.0,0.0,0.0,1.0,
            1.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,0.0
        ), 0
    ),
    //Ван
    Pair(
        doubleArrayOf(
            0.0,0.0,1.0,0.0,0.0,
            0.0,1.0,1.0,0.0,0.0,
            0.0,0.0,1.0,0.0,0.0,
            0.0,0.0,1.0,0.0,0.0,
            0.0,1.0,1.0,1.0,0.0
        ), 1
    ),
    //Ту
    Pair(
        doubleArrayOf(
            0.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,1.0,
            0.0,0.0,1.0,1.0,0.0,
            0.0,1.0,0.0,0.0,0.0,
            1.0,1.0,1.0,1.0,1.0
        ), 2
    ),
    //Фри
    Pair(
        doubleArrayOf(
            1.0,1.0,1.0,1.0,0.0,
            0.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,0.0,
            0.0,0.0,0.0,0.0,1.0,
            1.0,1.0,1.0,1.0,0.0
        ), 3
    ),
    //Фор
    Pair(
        doubleArrayOf(
            1.0,0.0,0.0,1.0,0.0,
            1.0,0.0,0.0,1.0,0.0,
            1.0,1.0,1.0,1.0,1.0,
            0.0,0.0,0.0,1.0,0.0,
            0.0,0.0,0.0,1.0,0.0
        ), 4
    ),
    //Файф
    Pair(
        doubleArrayOf(
            1.0,1.0,1.0,1.0,1.0,
            1.0,0.0,0.0,0.0,0.0,
            1.0,1.0,1.0,1.0,0.0,
            0.0,0.0,0.0,0.0,1.0,
            1.0,1.0,1.0,1.0,0.0
        ), 5
    ),
    //Сикс
    Pair(
        doubleArrayOf(
            0.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,0.0,
            1.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,0.0
        ), 6
    ),
    //Сэвен
    Pair(
        doubleArrayOf(
            1.0,1.0,1.0,1.0,1.0,
            0.0,0.0,0.0,0.0,1.0,
            0.0,0.0,0.0,1.0,0.0,
            0.0,0.0,1.0,0.0,0.0,
            0.0,0.0,1.0,0.0,0.0
        ), 7
    ),
    //Эйт
    Pair(
        doubleArrayOf(
            0.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,0.0
        ), 8
    ),
    //Найн
    Pair(
        doubleArrayOf(
            0.0,1.0,1.0,1.0,0.0,
            1.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,1.0,
            0.0,0.0,0.0,0.0,1.0,
            0.0,1.0,1.0,1.0,0.0
        ), 9
    )
)

@Composable
fun NeuralNetworkScreen(modifier: Modifier = Modifier) {
}